artillery.yml
config:
  target: "http://localhost:3005"
  phases:
    - duration: 10
      arrivalRate: 5
      name: Warm up
    - duration: 10
      arrivalRate: 10
      rampTo: 50
      name: Ramp up load
    - duration: 50
      arrivalRate: 100
      name: Sustained load
  payload:
    path: "products.csv"
    fields:
      - "product"
scenarios:
- name: "Search Reviews"
  flow:
    - get:
        url: "/reviews/?product_id={{ product }}"
- name: "Search Meta"
  flow:
    - get:
        url: "/reviews/meta/?product_id={{ product }}"


# artillery run artillery.yml